# Feature and Target Selection
## Selection of feature (X) and target (y) for supervised machine learning  
#### What are features (X) and target (y)?
- Feaures are columns carried the items that could led to the outcome of a result, denoted as X
- Target is the outcome of features, denoted as y 

#### Taitanic tragedy as an example
- Features such as Pclass, Sex, and Fare could be factors that led to the survival or perish of a passenger
- This is a binary classification, since the outcome of all considered features are either "Surived" or "Not Survived"  

#### Features and target
- For features, we will select columns of Pclass, Sex and Fare as features for supervised machine learning
- For target, we will select the column Surived


#### *first, lets import and explore the data*

In [3]:
#libraries
import os
import pandas as pd

In [10]:
#read .csv file into dataframe 
pwd = os.getcwd()
data = os.path.join(pwd, "data.csv")
df = pd.read_csv(data)

#first few lines of the dataset
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [15]:
#information about the imported dataframe,
#this included columns, null values ("blank cells") and data type
#for supervised machine learning, no missing values in both features and targets are required
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [35]:
#checking of the "Pclass" column as one of the features, whether it adds up the total number of rows, i.e. 891
df["Pclass"].value_counts(ascending=False)

3    491
1    216
2    184
Name: Pclass, dtype: int64

In [23]:
#checking of the "Sex" column as one of the features, whether it adds up the total number of rows, i.e. 891
df["Sex"].value_counts()

male      577
female    314
Name: Sex, dtype: int64

In [25]:
#checking of the "Fare" column as one of the features, whether it adds up the total number of rows, i.e. 891
#Unlike "Pclass" and "Sex" which are categorical data, it appears that "Fare" is continuous (very wide range)
#for now, without much exploratory data analysis (EDA), we will treat this as numeric
#using chain methods of .isna() and .sum(), all rows included Fare
df["Fare"].isna().sum()

0

In [20]:
#checking Survived column as the target, whether it adds up the total number of rows and how it was skewed (argument normalize=True)
#Binary classification
df["Survived"].value_counts(normalize=True)

0    0.616162
1    0.383838
Name: Survived, dtype: float64

## Feature Selection

In [26]:
#selecting features (X) and target (y)
X = df[["Pclass", "Sex", "Fare"]] 
y = df[["Survived"]]

In [28]:
#the first few lines of X
X.head()

   Pclass     Sex     Fare
0       3    male   7.2500
1       1  female  71.2833
2       3  female   7.9250
3       1  female  53.1000
4       3    male   8.0500

In [29]:
#the first few lines of y
y.head()

   Survived
0         0
1         1
2         1
3         1
4         0

In [31]:
#number of rows and columns
X.shape

(891, 3)

In [32]:
#number of rows and columns
y.shape

(891, 1)